Ran Plan for dir: `argo` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # argocd_application.request_headers will be created
+ resource "argocd_application" "request_headers" {
+       cascade  = true
+       id       = (known after apply)
+       status   = (known after apply)
+       validate = true
+       wait     = false

+       metadata {
+           generation       = (known after apply)
+           name             = "request-headers"
+           namespace        = "argo"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           project                = "default"
+           revision_history_limit = 10

+           destination {
                name      = null
+               namespace = "request-headers"
+               server    = "https://kubernetes.default.svc"
            }

+           ignore_difference {
+               group         = "apps"
+               json_pointers = [
+                   "/spec/replicas",
                ]
+               kind          = "Deployment"
            }

+           source {
+               path            = "apps/request-headers/k8s"
+               ref             = "values"
+               repo_url        = "https://github.com/jonpulsifer/ts.git"
+               target_revision = "HEAD"

+               kustomize {
+                   images = [
+                       "ghcr.io/jonpulsifer/does-not-exist=ghcr.io/jonpulsifer/request-headers:latest",
                    ]
                }
            }

+           sync_policy {
+               sync_options = [
+                   "CreateNamespace=true",
                ]

+               managed_namespace_metadata {
+                   labels = {
+                       "pod-security.kubernetes.io/audit"   = "restricted"
+                       "pod-security.kubernetes.io/enforce" = "restricted"
+                       "pod-security.kubernetes.io/warn"    = "restricted"
                    }
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d argo
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.lolwtf.ca/lock?id=jonpulsifer%252Finfra%252Fargo%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d argo
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```